# Chapter 5. Data Analysis with pandas

## Leading Questions to be answered
- What is the relationship between NumPy series and Pandas DataFrames?

- What makes indexes in Pandas different from the rest of the data?

- How do you access rows, columns, and values in a DataFrame using index and using boolean conditions?

- How do you get descriptive statistics, and how can you filter ("slice") those statistics by row, column, or value?

Pandas are the *Python Data Analysis Library*. Pandas can serves as an interface to get data in and out of Excel. Pandas' most important superpowers are vectorization and data alignment.

### DataFrame and Series

- A DataFrame is similar to a two-dimesional NumPy array, but it has column and row labels, and each column can hold different data types.

- By extracting a single column you get a one-dimensional series as they are all the same data type.

- Pandas labels its rows starting with 0 then incrimentting by 1 and its columns starting with A and going through the alphabet.

- Pandas can transfer Excel to an array very easily.

In [7]:
import pandas as pd

In [9]:
pd.read_excel("../Excel_Sheets/Dog Adoption.xlsx")

                 Item  Price  Quantity  Item Total  Total Left to Spend
0      Puppy Adoption  69.50       1.0       69.50               -51.16
1           Doggy Bed  41.88       2.0       83.76                  NaN
2          Dog Pillow  29.99       NaN        0.00                  NaN
3              Collar   9.98       3.0       29.94                  NaN
4          Short Lesh  16.99       4.0       67.96                  NaN
5   Retractable Leash  21.75       NaN        0.00                  NaN
6           Chew Toys   7.99       NaN        0.00                  NaN
7   4 Pack Fetch Toys  12.98       NaN        0.00                  NaN
8           Dog House  69.99       NaN        0.00                  NaN
9        1 Steel Bowl  12.99       NaN        0.00                  NaN
10      Plastic Bowls   9.50       NaN        0.00                  NaN
11  Bag O' Dog Treats  14.99       NaN        0.00                  NaN
12      Good Dog Food  16.98       NaN        0.00                  NaN
13      Best Dog Food  21.95       NaN        0.00                  NaN
14     GPS Pet Finder  55.00       NaN        0.00                  NaN
15   Training Classes  30.00       NaN        0.00                  NaN

It produces it as a nice HTML data table and it looks similar to that of Excel.

In [10]:
data = [["Mark", 55, "Italy", 4.5, "Europe"],
                ["John", 33, "USA", 6.7, "America"],
                ["Tim", 41, "USA", 3.9, "America"],
                ["Jenny", 12, "Germany", 9.0, "Europe"]]
df = pd.DataFrame(data=data,
                    columns=["name", "age", "country",
                                   "score", "continent"],
                    index=[1001, 1000, 1002, 1003])
df

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

```data=data``` data is not the same thing. the ```data``` on the left of the = sign is the name of the function parameter, and the ```data``` on the right of the = sign is the variable name and this is subject to change.

Calling ```info``` gives you basic information.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   age        4 non-null      int64
 2   country    4 non-null      object
 3   score      4 non-null      float64
 4   continent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

- The row labels of a DataFrame are called *index*.

- pandas automatically create an integer index starting from zero.

- An index is essential for many common operations.

In [12]:
df.index

Index([1001, 1000, 1002, 1003], dtype='int64')

In [13]:
df.index.name = "user_id"
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

A DataFrame index can have duplicates.

```reset_index```: Turns in index into a regular column

```set_index```: Sets a new index

In [14]:
df.reset_index()

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [15]:
df.reset_index().set_index("name")

       user_id  age  country  score continent
name
Mark      1001   55    Italy    4.5    Europe
John      1000   33      USA    6.7   America
Tim       1002   41      USA    3.9   America
Jenny     1003   12  Germany    9.0    Europe

```reindex``` will take over all rows that match the new index, and will add rows with missing values where there was no information.

In [16]:
df.reindex([999, 1000, 1001, 1004])

         name   age country  score continent
user_id
999       NaN   NaN     NaN    NaN       NaN
1000     John  33.0     USA    6.7   America
1001     Mark  55.0   Italy    4.5    Europe
1004      NaN   NaN     NaN    NaN       NaN

To sort it use ```sort_index```.

In [17]:
df.sort_index()

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1001      Mark   55    Italy    4.5    Europe
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

You can also sort by values.

In [18]:
df.sort_values(["continent", "age"])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe
1001      Mark   55    Italy    4.5    Europe

In [19]:
df.columns # Getting info from the columns

Index(['name', 'age', 'country', 'score', 'continent'], dtype='object')

Unlike the rows you should always give the columns a name as they usually represent variables.

In [20]:
df.columns.name = "properties"
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [21]:
df.rename(columns={"name": "First Name", "age": "Age"}) # Renaming the columns

properties First Name  Age  country  score continent
user_id
1001             Mark   55    Italy    4.5    Europe
1000             John   33      USA    6.7   America
1002              Tim   41      USA    3.9   America
1003            Jenny   12  Germany    9.0    Europe

To delete columns use this.

In [22]:
df.drop(columns=["name", "country"],
index=[1000, 1003])

properties  age  score continent
user_id
1001         55    4.5    Europe
1002         41    3.9   America

By transposing your columns and the index you can swap them

In [23]:
df.T

user_id       1001     1000     1002     1003
properties
name          Mark     John      Tim    Jenny
age             55       33       41       12
country      Italy      USA      USA  Germany
score          4.5      6.7      3.9      9.0
continent   Europe  America  America   Europe

***Remember the DataFrame is stil unchanged as we never reassigne the Returning DataFram from the method calles back to the orignial df variable***

In [24]:
df.loc[:, ["continent", "country", "name", "age", "score"]] #Switching them back

properties continent  country   name  age  score
user_id
1001          Europe    Italy   Mark   55    4.5
1000         America      USA   John   33    6.7
1002         America      USA    Tim   41    3.9
1003          Europe  Germany  Jenny   12    9.0

### Data Manipulation

**Selecting by Label**

- The attribute ```loc``` stands for *location*.
- It looks like this:
    - ```df.loc[row_selection, column_selection]```
- ```loc``` supports slice notation
- Using slice notation with labels is inconsistent.

In [25]:
df.loc[1001, "name"]

'Mark'

In [26]:
df.loc[[1001, 1002], "age"]

user_id
1001    55
1002    41
Name: age, dtype: int64

Difference between DataFrame with one or more columns and a Series: 
- Even with a single column, DataFrames are two-dimensional, while Series are one-dimensional.
- Both DataFrame and Series have an index, but only the DataFrame has column headers.
- When you perform arithmetic calculations, the behavior differs: with DataFrames, pandas aligns the data according to the column headers.

**Selecting By Position**
- ```iloc``` stands for integer location
- ```df.iloc[row_selection, column_selection]```: this is the syntax

In [27]:
df.iloc[0, 0]

'Mark'

In [ ]:
df.iloc[[0, 2], 1]

In [ ]:
df.iloc[:3, [0, 2]]

**Selecting By Boolean Indexing**
- Selecting subsets of a DataFrame whose data is only ```True``` or ```False```
- Boolean Series are used to select specific rows and columns
- Boolean DataFrames are used to select specific values across the whole DataFrame
- You can't use Pythons Boolean operators.
- Make sure to put every boolean expression in parentheses

In [28]:
tf = (df["age"] > 40) & (df["country"] == "USA")
tf

user_id
1001    False
1000    False
1002     True
1003    False
dtype: bool

In [29]:
df.loc[tf, :]

properties name  age country  score continent
user_id
1002        Tim   41     USA    3.9   America

The ``in`` operator in Python is ``isin`` with a Series.

In [31]:
df.loc[df["country"].isin(["Italy", "Germany"]), :]

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1003        Jenny   12  Germany    9.0    Europe

DataFrames has a special syntax without ``loc`` to select values given the full DataaFrame of booleans. 
```
df[boolean_df]
```

This is helpful when you have a DataFrame of only numbers.

In [32]:
rainfall = pd.DataFrame(data={"City 1": [300.1, 100.2],
                                "City 2": [400.3, 300.4],
                               "City 3": [1000.5, 1100.6]})
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [33]:
rainfall < 400

   City 1  City 2  City 3
0    True   False   False
1    True    True   False

### Descriptive Statistics and Data Aggregation

**Descriptive Statistics**
- Descriptive statistics allows you to summarize datasets by using quantitative measures.
- Averages like mean, median, or mode are other popular examples.
- There are methods like ``sum``, ``mean``, and ``count``.

In [34]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [35]:
rainfall.mean()

City 1     200.15
City 2     350.35
City 3    1050.55
dtype: float64

In [36]:
rainfall.mean(axis=1) # Gives a statistics per row

0    566.966667
1    500.400000
dtype: float64

``Nan`` values are ignored

**Grouping**
- You can group rows and then use the different methods on that group

In [ ]:
df.groupby(["continent"]).mean()

In [ ]:
df.groupby(["continent", "country"]).mean()

If you want to use your own function, use the ``agg`` method.

In [42]:
selection = df.loc[:, ["age", "score", "continent"]]
selection.groupby(["continent"]).agg(lambda x: x.max() - x.min())

properties  age  score
continent
America       8    2.8
Europe       43    4.5

## Leading Questions answered
- What is the relationship between NumPy series and Pandas DataFrames?
    - A pandas DataFrame is like a table of multiple NumPy series.
    - Series is 1D, while DataFrame is 2D
- What makes indexes in Pandas different from the rest of the data?
    - Indexes label rows and can be used to access data, but they are not part of the data.
    - Indexes are used for alignment opertators.
- How do you access rows, columns, and values in a DataFrame using index and using boolean conditions?
    - ``loc`` for label-based
    - ``iloc`` for integer-based
    - ``df["col_name"]`` for columns
    - ``df[df['col'] > value]``
- How do you get descriptive statistics, and how can you filter ("slice") those statistics by row, column, or value?
    - ``df.loc[row_label].describe()`` by row
    - ``df.loc['col_name'].describe()`` by column
    - ``df[df['col'] > value].describe()`` by value